pkg/cbmodels/lizenzdiskussion.tex
% Created 2012-07-16 Mo 10:34
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{fixltx2e}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{float}
\usepackage{wrapfig}
\usepackage{soul}
\usepackage{textcomp}
\usepackage{marvosym}
\usepackage{wasysym}
\usepackage{latexsym}
\usepackage{amssymb}
\usepackage{hyperref}
\tolerance=1000
\providecommand{\alert}[1]{\textbf{#1}}

\title{Lizenz für Softwareentwicklung am IPHT}
\author{Claudia Beleites}
\date{2012-07-16 Mo}
\hypersetup{
  pdfkeywords={},
  pdfsubject={},
  pdfcreator={Emacs Org-mode version 7.8.02}}

\begin{document}

\maketitle

\setcounter{tocdepth}{3}
\tableofcontents
\vspace*{1cm}


\section{Überlegungen zu einer Lizenz für cbmodels}
\label{sec-1}


\begin{itemize}
\item sollen Lizenzen nach außen (IPC, Rest der Welt) gegeben werden oder nicht?
\item anderweitige Veröffentlichung (eigenes Paper)?
\end{itemize}
\subsection{Vorschlag}
\label{sec-1-1}


\begin{itemize}
\item ich schlage GPL >= 3.0 vor
\item da das Paket die Pakete MASS und pls nutzt, die selbst unter GPL stehen, ist sowieso nur eine GPL-kompatible Lizenz möglich.
\item Veröffentlichung als eigener Artikel im Journal of Statistical Software (peer-review des Quellcodes) ist angestrebt.
\end{itemize}
\section{Überlegungen, die in Triest zur GPL geführt haben}
\label{sec-2}


Vielleicht ist es ganz hilfreich, wenn ich mal zusammenstelle, wie wir an der Uni Triest für
hyperSpec zu dem Schluss gekommen sind, es unter einer freien, quelloffenen Lizenz (FOSS = free and
open source software) zu veröffentlichen. Letztlich ist die Entscheidung zwischen FOSS und
prorietärer Verwertung eine ziemliche Weichenstellung.
\subsection{Infrastruktur}
\label{sec-2-1}

\begin{itemize}
\item Auf das CRAN (weltweit verfügbare Struktur zum Vertrieb von R Packages) darf nur FOSS Software
\item (``Drittmittelgeber'' Google Summer of Code verlangt FOSS Veröffentlichung)
\item FOSS Software kann r-forge nutzen (Entwicklungsserver; weniger wichtig, wenn wir einen eigenen
  solchen Server betreiben)
\end{itemize}
\subsection{Langzeit-Pflege}
\label{sec-2-2}

\begin{itemize}
\item geringeres Risiko, dass das gesamte Wissen mit Weggang des Entwicklers verloren geht
\item höhere Chance, von Entwicklung vor und nach dem Arbeitsvertrag zu profitieren
\item bei FOSS größerer Nutzerkreis, das bedeutet auch: mehr und verteilteres Wissen (Nutzer können
  Fragen im Internet stellen und bekommen sinnvolle Antworten)
\item Chance auf Beiträge von Nutzern zur Software
\item Bei größerem Nutzerkreis ``amortisiert'' sich der hohe Aufwand beim Schreiben von langfristig verständlichem Code
\item Thema Aufwand:
\begin{itemize}
\item Bei hyperSpec schätze ich, dass zwischen 1/2 und 2/3 des Entwicklungsaufwandes in die Dokumentation und Handbücher gehen.
\item softclassval implementiert komplett neue chemometrische Methoden; hier gibt es kein
    ``Nutzerhandbuch'' wie bei hyperSpec (satt dessen gleich einen Artikel), aber viele Unit-Tests zum Überprüfen, ob die
    Rechnungen auch stimmen. Von diesem Paket sind etwas über 1/3 der Codezeilen Dokumentation und
    Kommentare, und jeweils etwas unter 1/3 Code, der die eigentliche Funktionalität bereitstellt und
    ebensoviel Code für die Unit-Tests.
\end{itemize}
\item bei FOSS kann ich als Entwickler/Maintainer sehr viel einfacher als bei proprietären Lizenzen
  Nutzeranfragen nach Erweiterungen beantworten mit
\begin{itemize}
\item dem Hinweis, dass die Software FOSS ist, der Nutzer also alle erforderlichen Anpassungen selbst vornehmen darf und kann.
\item Je nachdem, wie ich das allgemeine Interesse an der angesprochenen Funktionalität einschätze,
    füge ich hinzu, dass ich aber gern bereit bin bzw. bitte darum, den so entstandenen Code unter
    Nennung des jeweiligen Autors in das Paket aufzunemen (und damit die Wartung übernehme), wenn er
    allgemeingültig geschrieben und ordentlich dokumentiert ist. (Das macht auch dem Nutzer das Leben
    dann viel bequemer).
\end{itemize}
\end{itemize}
\subsection{Veröffentlichung als wissenschaftlicher Artikel}
\label{sec-2-3}

\begin{itemize}
\item Veröffentlichung mit peer-review des Quellcodes beim Journal of Statistical Software an FOSS-Lizenz
  gebunden, ähnlich bei anderen Zeitschriften die Software als wissenschaftliche Veröffentlichung behandeln.
\item Für chemometrische Methoden mit entsprechender ``Erfindungshöhe'' ist ggf. eine Veröffentlichung ohne
  Offenlegung des Quellcodes möglich. Ich gehe aber davon aus, dass das in der Regel nicht
  erstrebenswert ist:
\begin{itemize}
\item Entweder die Methode ist im Artikel genau genug beschrieben, dass sie durch Neuprogrammieren
     reproduziert werden kann. Dann halte ich es für besser, die Implementierung FOSS zu
     veröffentlichen. Dadurch wird \underline{unsere} Software verwendet, anderenfalls verwenden fremde Gruppen
     ihre eigene.
\item Ist die Methode nicht so genau beschrieben, dass sie einfach implementiert werden kann, so ist
     die Reproduzierbarkeit im Sinne guter wissenschaftlicher Praxis nicht gegeben.
\item Soll die Methode nicht offengelegt werden, dann wäre eher Markenrecht gefragt als
     wissenschaftliche Veröffentlichungen über die Methode (im Unterschied zu
     wiss. Veröffentlichungen von Anwendungen, die mit dieser Methode bearbeitet wurden).
\end{itemize}
\item Zitat klar einforderbar
\end{itemize}
\subsection{Nutzung, Weiterentwicklung und Derivate}
\label{sec-2-4}


\begin{itemize}
\item In Triest haben wir beschlossen, die Software unter GPL zu veröffentlichen. So ist einerseits FOSS
  ist sichergestellt, und andererseits, dass Derivate ebenfalls unter einer solchen Lizenz stehen
  müssen.
\item sozusagen als akademische Form der Lizenzgebühr fordern wir Zitate ein
\item Die Behandlung einer proprietären Lizenz haben wir als wesentlich zu aufwändig eingestuft (zumal da
  ja eine ganze Menge Infrastruktur und ggf. langfristige Verpflichtungen dranhängen).
\item mir als Entwickler gibt die FOSS Lizenz Rechtssicherheit über die Nutzung \& Entwicklung über den jeweiligen Arbeitsvertrag hinaus
\begin{itemize}
\item es ist unerheblich, wo gewonnenes Erfahrungswissen aufhört und die Verwertungsrechte des IPHT beginnen
\item es ist vollkommen unproblematisch, wenn ich nochmal in den Code schauen soll, um Fragen zu beantworten.
\end{itemize}
\item Gemeinsame Nutzung an IPC und IPHT (oder ggf. mit anderen Kooperationspartnern) braucht keine weiteren Vereinbarungen.
\end{itemize}

\end{document}
